//each循环
		$(function() {
			//定义数组保存省份
			var provs = ["北京", "上海", "天津", "重庆", "黑龙江", "吉林", "辽宁", "山东", "山西", "陕西", "河北", "河南", "湖北", "湖南", "海南", "江苏", "江西", "广东", "广西", "云南", "贵州", "四川", "内蒙古", "宁夏", "甘肃", "青海", "西藏", "新疆", "安徽", "浙江", "福建", "台湾", "香港", "澳门", ];

			$.each(provs, function(index, element) {
				$("#province").append("<option>" + element + "</option>");
			});

			$("#province").change(function() {
				$("#city").empty();
				var city = [
					["东城", "西城", "崇文", "宣武", "朝阳", "丰台", "石景山", "海淀门", "头沟", "房山", "通州", "顺义", "昌平", "大兴", "怀柔", "平谷", "密云县", "延庆县"],
					["黄浦 ", "卢湾", " 徐汇 ", "长宁", " 静安 ", "普陀 ", "闸北","虹口", " 杨浦 ", "闵行 ", "宝山 ", "嘉定", " 浦东新", " 金山","松江", " 青浦", " 南汇", " 奉贤 ", "崇明县"],
					["和平 ", "河东", " 河西 ", "南开", " 河北 ", "红桥 ", "塘沽 ", "汉沽 ", "大港 ", "东丽", "  西青", " 津南 ", "北辰 ", "武清 ", "宝坻", " 宁河县", "  静海县 ", " 蓟县"],
					["万州 ", "涪陵", " 渝中", " 大渡口", " 江北", " 沙坪坝", " 九龙坡", "  南岸 ", "北碚  ", "万盛", " 双桥 ", "渝北 ", "巴南", " 黔江", " 长寿 ", "江津 ", "合川 ", "永川 ", "南川 ", " 綦江县", " 潼南县", " 铜梁县", " 大足县", " 荣昌县 ", "璧山县", " 梁平县", " 城口县", " 丰都县", "垫江县 ", "武隆 ", "忠县 ", "开县 ", "云阳县 ", "奉节县 ", "巫山县", " 巫溪县", " 石柱土家族自治县", " 秀山土家族苗族自治县", " 酉阳土家族苗族自治县", " 彭水苗族土家族自治县"],
					["哈尔滨", " 齐齐哈尔 ", "鸡西 ", "鹤岗 ", "双鸭山 ", "大庆 ", "伊春", "佳木斯 ", "七台河 ", "牡丹江", " 黑河", " 绥化", " 大兴安岭地"],
					["长春 ", "吉林", " 四平", " 辽源 ", "通化", " 白山", "松原 ", "白城 ", "延边朝鲜族自治州"],
					["沈阳 ", "大连 ", "鞍山", " 抚顺", " 本溪", " 丹东 ", "锦州 ", "营口 ", "阜新 ", "辽阳  ", "盘锦", " 铁岭 ", "朝阳", " 葫芦岛"],
					["济南 ", "青岛", " 淄博 ", "枣庄 ", "东营", " 烟台", " 潍坊  ", "济宁 ", "泰安", " 威海", "日照 ", "莱芜 ", "临沂 ", "德州", " 聊城", " 滨州", " 菏泽"],
					["太原 ", "大同", " 阳泉 ", "长治 ", "晋城", " 朔州", "晋中", " 运城", " 忻州", " 临汾 ", "吕梁"],
					["西安 ", "铜川", " 宝鸡", " 咸阳", " 渭南 ", "延安", "汉中 ", "榆林 ", "安康", " 商洛"],
					["石家庄 ", "唐山", " 秦皇岛 ", "邯郸", " 邢台", " 保定", "张家口", " 承德 ", "沧州 ", "廊坊 ", "衡水"],
					["郑州 ", "开封", " 洛阳", " 平顶山 ", "安阳 ", "鹤壁 ", "新乡 ", "焦作","济源 ", "濮阳", "许昌", " 漯河", " 三门峡", " 南阳 ", "商丘 ", "信阳", " 周口 ", "驻马店"],
					["武汉", "  黄石 ", " 十堰", "  宜昌 ", " 襄樊 ", " 鄂州 ", " 荆门", "  孝感 ", " 荆州 ", " 黄冈 ", "  咸宁 ", " 随州", "  恩施土家族苗族自治州", "  仙桃", " 潜江", " 天门 ", "神农架林"],
					["长沙", " 株洲", " 湘潭", " 衡阳", " 邵阳", " 岳阳 ", "常德 ", "张家界", "益阳", " 郴州", " 永州 ", "怀化 ", "娄底 ", "湘西土家族苗族自治州"],
					["海口", " 三亚 ", "五指山", " 琼海 ", "儋州", " 文昌", " 万宁", " 东方 ", "定安县 ", "屯昌县澄迈县 ", "临高县 ", "白沙黎族自治县 ", "昌江黎族自治县 ", "乐东黎族自治县 ", "陵水黎族自治县", " 保亭黎族苗族自治县", " 琼中黎族苗族自治县"],
					["南京", " 无锡 ", "徐州", " 常州 ", "苏州", " 南通 ", "连云港", " 淮安", "盐城", " 扬州 ", "镇江 ", "泰州", " 宿迁"],
					["南昌", " 景德镇 ", "萍乡 ", "九江 ", "新余", " 鹰潭", " 赣州", " 吉安", "宜春 ", "抚州 ", "上饶"],
					["广州", " 韶关 ", "深圳", " 珠海 ", "汕头", " 佛山", " 江门 ", "湛江", " 茂名", "肇庆  ", "惠州 ", "梅州", " 汕尾 ", "河源 ", "阳江", " 清远", "东莞 ", "中山 ", "潮州 ", "揭阳", " 云浮"],
					["南宁 ", "柳州 ", "桂林 ", "梧州 ", "北海", " 防城港 ", "钦州 ", "贵港", "玉林 ", "百色", " 贺州", " 河池", " 来宾", " 崇左"],
					["昆明 ", "曲靖 ", "玉溪 ", "保山 ", "昭通 ", "丽江 ", "思茅 ", "临沧", "楚雄彝族自治州", " 红河哈尼族彝族自治州 ", "文山壮族苗族自治州", "西双版纳傣族自治州 ", "大理白族自治州 ", "德宏傣族景颇族自治州", "怒江傈僳族自治州 ", "迪庆藏族自治州"],
					["贵阳", " 六盘水 ", "遵义 ", "安顺 ", "铜仁地 ", "毕节地", "黔西南布依族苗族自治州", "  黔东南苗族侗族自治州  ", "黔南布依族苗族自治州"],
					["成都", " 自贡 ", "攀枝花 ", "泸州", " 德阳 ", "绵阳 ", "广元", " 遂宁", "内江", " 乐山", " 南充 ", "眉山 ", "宜宾", " 广安","达州 ", "雅安", "巴中 ", "资阳", " 阿坝藏族羌族自治州  ", "甘孜藏族自治州  ", "凉山彝族自治州"],
					["呼和浩特 ", "包头 ", "乌海 ", "赤峰 ", "通辽 ", "鄂尔多斯", " 呼伦贝尔", "巴彦淖尔 ", "乌兰察布 ", "兴安盟  ", "锡林郭勒盟", "  阿拉善盟"],
					["银川 ", "石嘴山 ", "吴忠 ", "固原 ", "中卫"],
					["兰州 ", "嘉峪关 ", "金昌 ", "白银", " 天水", " 武威 ", "张掖", " 平凉", "酒泉", " 庆阳 ", "定西", " 陇南 ", " 临夏回族自治州 ", " 甘南藏族自治州"],
					["西宁 ", "海东地 ", "海北藏族自治州  ", "黄南藏族自治州  ", "海南藏族自治州", "果洛藏族自治州  ", "玉树藏族自治州  ", "海西蒙古族藏族自治州"],
					["拉萨 ", "昌都地 ", "山南地", " 日喀则地 ", "那曲地 ", "阿里地 ", "林芝地"],
					["乌鲁木齐 ", " 克拉玛依 ", " 吐鲁番地 ", " 哈密地 ", " 昌吉回族自治州", "博尔塔拉蒙古自治州  ", "巴音郭楞蒙古自治州  ", "阿克苏地", "克孜勒苏柯尔克孜自治州  ", "喀什地和田地  ", "伊犁哈萨克自治州", "塔城地 ", " 阿勒泰地", "  石河子阿拉尔", "  图木舒克五家渠"],
					["合肥 ", "芜湖 ", "蚌埠", " 淮南 ", "马鞍山", " 淮北 ", "铜陵 ", "安庆", "黄山 ", "滁州", " 阜阳 ", "宿州", " 巢湖", " 六安", " 亳州", " 池州", " 宣城"],
					["杭州 ", " 宁波", "  温州 ", " 嘉兴", "  湖州", "  绍兴", " 金华 ", " 衢州", "  舟山 ", " 台州 ", " 丽水"],
					["福州", "  厦门", "  莆田 ", " 三明", "  泉州", "  漳州 ", " 南平", "  龙岩", "  宁德"],
					["台北 ", " 高雄 ", " 基隆", "  台中 ", " 台南 ", " 新竹", "  嘉义"],
					["中西", "  湾仔", "  东", "  南", "  油尖旺 ", " 深水埗 ", " 九龙城 ", " 黄大仙 ", " 观塘 ", " 荃湾","葵青 ", " 沙田 ", " 西贡 ", " 大埔 ", " 北 ", " 元朗 ", " 屯门 ", " 离岛"],
					["澳门"]
				];
				//获取选择的省份 的索引
				var index = $("#province").prop('selectedIndex');
				if($("#province").prop('selectedIndex') == 0) {
					alert("请选择省份!");
					return;
				}
				$.each(city[index - 1], function(index, element) {
					$("#city").append("<option>" + element + "</option>");
				});

			});

		});